// 初始化数据库 sql 语句
module.exports.user_info_ddl =
  `CREATE TABLE IF NOT EXISTS user_info
    (
      id         INTEGER PRIMARY KEY autoincrement,
      username   VARCHAR(20)  NOT NULL,
      password   VARCHAR(50)  NOT NULL,
      email      VARCHAR(50)  NULL,
      age        INT          NULL,
      gender     VARCHAR(20)  NULL,
      tel        VARCHAR(11)  NULL,
      wechat     VARCHAR(50)  NULL,
      qq         VARCHAR(20)  NULL,
      city       VARCHAR(50)  NULL,
      remark     VARCHAR(255) NULL,
      UNIQUE (email)
    )`

module.exports.order_info_ddl =
  `CREATE TABLE IF NOT EXISTS order_info
    (
      id            INTEGER PRIMARY KEY autoincrement,
      create_time   DATETIME     NOT NULL,
      creator_name  VARCHAR(20)  NOT NULL,
      creator_id    INT          NOT NULL,
      update_time   DATETIME     NOT NULL,
      status        INT          NOT NULL,
      receiver_name VARCHAR(20)  NULL,
      receiver_id   INT          NULL,
      receive_time  DATETIME     NULL,
      start_time    DATETIME     NOT NULL,
      end_time      DATETIME     NOT NULL,
      location      VARCHAR(255) NOT NULL,
      remark        VARCHAR(255) NULL,
      title         VARCHAR(255) NOT NULL,
      city          VARCHAR(255) NOT NULL,
      foreign key (creator_id) references user_info(id),
      foreign key (receiver_id) references user_info(id)
    );`

module.exports.user_info_data = [
    ['小一最酷了', 'e10adc3949ba59abbe56e057f20f883e', 'xiaoyi@qq.com', 17, 'male', '13344556677', 'nottellyou', '100000', '北京市,北京市', '愿得一学霸，白首不相离，带我上自习，一日刷千题'],
    ['测试账号', 'e10adc3949ba59abbe56e057f20f883e', 'test@qq.com', 17, 'male', '13535353535', 'heiheihei', '12306', '北京市,北京市', '这是一个测试账号']
]

module.exports.order_info_data = [
    ['2018-11-11 12:12:12', '小一最酷了', 1, '2018-11-11 12:12:12', 5, '测试账号', 2, '2018-11-11 12:12:12', '2018-11-11', '2019-11-11', '首都图书馆', '救救孩子吧', '等一个学友', '北京市,北京市'],
    ['2018-11-11 12:12:13', '小一最酷了', 1, '2018-11-11 12:12:12', 5, '测试账号', 2, '2018-11-11 12:12:12', '2018-11-11', '2019-11-11', '首都图书馆', '救救孩子吧', '等一个学友', '北京市,北京市'],
    ['2018-11-11 12:12:14', '小一最酷了', 1, '2018-11-11 12:12:12', 5, '测试账号', 2, '2018-11-11 12:12:12', '2018-11-11', '2019-11-11', '首都图书馆', '救救孩子吧', '等一个学友', '北京市,北京市'],
    ['2018-11-11 12:12:15', '小一最酷了', 1, '2018-11-11 12:12:12', 5, '测试账号', 2, '2018-11-11 12:12:12', '2018-11-11', '2019-11-11', '首都图书馆', '救救孩子吧', '等一个学友', '北京市,北京市'],
    ['2018-11-11 12:12:16', '小一最酷了', 1, '2018-11-11 12:12:12', 5, '测试账号', 2, '2018-11-11 12:12:12', '2018-11-11', '2019-11-11', '首都图书馆', '救救孩子吧', '等一个学友', '北京市,北京市'],
    ['2018-11-11 12:12:17', '小一最酷了', 1, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '北京东城区', '图书馆咖啡店都可以。不在东城区也可以考虑，车程一小时以内都可以。求互相督促的小伙伴！', '北京东城区约自习！', '北京市,北京市'],
    ['2018-11-11 12:12:18', '小一最酷了', 1, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '首图和东边的图书馆自习室都可以', '周一到周末长期自习，准备英语考试。诚心实意一起正能量加油，一起监督。', '北京找一起约自习的学友 东二三环', '北京市,北京市'],
    ['2018-11-11 12:12:19', '小一最酷了', 1, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '无所谓', '本人男，目前在一家私募做量化分析，周末打算学习机器学习方面的算法。想找一位学友一起周末好好看书！我在日本和美国留学过，如果你学习英语日语数学等方面的内容，我可以帮你。每次自习，请你喝一杯咖啡。', '北京找一位一起学习的学伴，地点无所谓。', '北京市,北京市'],
    ['2018-11-11 12:12:20', '小一最酷了', 1, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '上外上财（虹口），同济复旦（我没去过～），上大延长校区比较近。周末可接受浦东图书馆～！（强推）咖啡馆图书馆', '现在考证，目测后期还要考研，身患无法在家复习症。 工作日六七点，周末～诚邀同上自习小伙伴～本人妹子，来一打妹子最好啦ヾ(≧∇≦*)ヾ', '求同上自习的小伙伴(￣▽￣)／下班晚上或者周末～', '上海市,上海市'],
    ['2018-11-11 12:12:11', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '人大', '工作一年…单位离人大很近…想给自己充点电…有没有同学一起上自习的…男女不限…', '求一起上自习', '北京市,北京市'],
    ['2018-11-11 12:12:10', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '杭州图书馆，大学教室都可以', '最近自学中，求同伴一起去自习，杭州图书馆，大学教室都可以。', '求伴周末图书馆自习', '浙江省,杭州市'],
    ['2018-11-11 12:12:09', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '都可以', '求学友啊！上海的，一起自习啊，楼主杀鸡，一起啊！', '我要上自习！！', '上海市,上海市'],
    ['2018-11-11 12:12:08', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '都可以', '求学友啊！上海的，一起自习啊，楼主杀鸡，一起啊！', '我要上自习！！', '上海市,上海市'],
    ['2018-11-11 12:12:07', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '都可以', '求学友啊！上海的，一起自习啊，楼主杀鸡，一起啊！', '我要上自习！！', '上海市,上海市'],
    ['2018-11-11 12:12:06', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '都可以', '求学友啊！上海的，一起自习啊，楼主杀鸡，一起啊！', '我要上自习！！', '上海市,上海市'],
    ['2018-11-11 12:12:05', '测试账号', 2, '2018-11-11', 2, null, null, null, '2018-11-11', '2019-11-11', '都可以', '求学友啊！上海的，一起自习啊，楼主杀鸡，一起啊！', '我要上自习！！', '上海市,上海市'],
]